; ModuleID = 'alloc.db98974eb1e1f83e-cgu.0'
source_filename = "alloc.db98974eb1e1f83e-cgu.0"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "riscv64"

%"core::fmt::rt::Argument<'_>" = type { %"core::fmt::rt::ArgumentType<'_>" }
%"core::fmt::rt::ArgumentType<'_>" = type { ptr, [1 x i64] }

@alloc_e4c0784e4975da2173a354afd99193ad = private unnamed_addr constant <{ [101 x i8] }> <{ [101 x i8] c"unsafe precondition(s) violated: slice::get_unchecked_mut requires that the range is within the slice" }>, align 1
@alloc_424341b75ece3fa20496f1c69b9fb0ac = private unnamed_addr constant <{ [111 x i8] }> <{ [111 x i8] c"unsafe precondition(s) violated: ptr::write_bytes requires that the destination pointer is aligned and non-null" }>, align 1
@alloc_8df0580a595a87d56789d20c7318e185 = private unnamed_addr constant <{ [166 x i8] }> <{ [166 x i8] c"unsafe precondition(s) violated: ptr::copy_nonoverlapping requires that both pointer arguments are aligned and non-null and the specified memory ranges do not overlap" }>, align 1
@alloc_2f5fae7ca9908dec8d13988b47dc9dc4 = private unnamed_addr constant <{ [104 x i8] }> <{ [104 x i8] c"unsafe precondition(s) violated: ptr::copy requires that both pointer arguments are aligned and non-null" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<core::fmt::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::fmt::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !15, identifier: "63674b1f65b2c64bebf83fcfaf1766a6")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !13, file: !2, align: 8, flags: DIFlagPublic, elements: !15, identifier: "88bdaad12ab9292616a11cf434e5c7ba")
!13 = !DINamespace(name: "fmt", scope: !14)
!14 = !DINamespace(name: "core", scope: null)
!15 = !{}
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !18, isLocal: true, isDefinition: true)
!18 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::alloc::layout::LayoutError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !19, vtableHolder: !24, templateParams: !15, identifier: "4c41886309f81ac29c8d00d501df1c2d")
!19 = !{!20, !21, !22, !23}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !18, file: !2, baseType: !6, size: 64, align: 64)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !18, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !18, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !18, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!24 = !DICompositeType(tag: DW_TAG_structure_type, name: "LayoutError", scope: !25, file: !2, align: 8, flags: DIFlagPublic, elements: !15, identifier: "37092b2118b02d8f439ac079f06d5fd8")
!25 = !DINamespace(name: "layout", scope: !26)
!26 = !DINamespace(name: "alloc", scope: !14)
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !29, isLocal: true, isDefinition: true)
!29 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !30, vtableHolder: !35, templateParams: !15, identifier: "a162cd4ae345764875658bb3cbd44159")
!30 = !{!31, !32, !33, !34}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !29, file: !2, baseType: !6, size: 64, align: 64)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !29, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !29, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !29, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !36, size: 64, align: 64, dwarfAddressSpace: 0)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !37, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !38, templateParams: !15, identifier: "d6f22cc22e45f5f9ab187b52200cd8f")
!37 = !DINamespace(name: "option", scope: !14)
!38 = !{!39}
!39 = !DICompositeType(tag: DW_TAG_variant_part, scope: !36, file: !2, size: 16, align: 8, elements: !40, templateParams: !15, identifier: "a4b7745bcbc13388ebd9a5ae2e02626d", discriminator: !50)
!40 = !{!41, !46}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !39, file: !2, baseType: !42, size: 16, align: 8, extraData: i128 0)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !36, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !43, identifier: "e75e27fd01985ed823243db98f60256b")
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "T", type: !45)
!45 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !39, file: !2, baseType: !47, size: 16, align: 8, extraData: i128 1)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !36, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !48, templateParams: !43, identifier: "982ee1d8d7bc989f6182243a83f0e8b8")
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !47, file: !2, baseType: !45, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, scope: !36, file: !2, baseType: !45, size: 8, align: 8, flags: DIFlagArtificial)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !53, isLocal: true, isDefinition: true)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !54, vtableHolder: !9, templateParams: !15, identifier: "651e42ea9eb042c89f2b7861a55a4456")
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !53, file: !2, baseType: !6, size: 64, align: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !53, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !53, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!59 = !DIGlobalVariableExpression(var: !60, expr: !DIExpression())
!60 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !61, isLocal: true, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !62, vtableHolder: !67, templateParams: !15, identifier: "d2eae5b11831f76cbc4372ca7516e0db")
!62 = !{!63, !64, !65, !66}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !61, file: !2, baseType: !6, size: 64, align: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !61, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !61, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !61, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !DIGlobalVariableExpression(var: !69, expr: !DIExpression())
!69 = distinct !DIGlobalVariable(name: "<alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !70, isLocal: true, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::String as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !71, vtableHolder: !78, templateParams: !15, identifier: "de84d384ef59952886253fb60dc36eaf")
!71 = !{!72, !73, !74, !75, !76, !77}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !70, file: !2, baseType: !6, size: 64, align: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !70, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !70, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !70, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !70, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !79, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !15, identifier: "b275c777de813c51d4268b3f3840e4a7")
!79 = !DINamespace(name: "string", scope: !80)
!80 = !DINamespace(name: "alloc", scope: null)
!81 = !{!82}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !78, file: !2, baseType: !83, size: 192, align: 64, flags: DIFlagPrivate)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !84, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !85, templateParams: !117, identifier: "27ecb52cbde396d1cbae4542d3333c15")
!84 = !DINamespace(name: "vec", scope: !80)
!85 = !{!86, !118}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !83, file: !2, baseType: !87, size: 128, align: 64, flags: DIFlagPrivate)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !88, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !89, templateParams: !117, identifier: "3a51bfb4ab6f4c48ba8b5eb870ee92dd")
!88 = !DINamespace(name: "raw_vec", scope: !80)
!89 = !{!90, !116}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !87, file: !2, baseType: !91, size: 128, align: 64, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !88, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !92, templateParams: !114, identifier: "b5b458590724f0b3ea825e5d9279915")
!92 = !{!93, !107, !111}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !91, file: !2, baseType: !94, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !95, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !97, templateParams: !43, identifier: "ac7a1d5852033f0295dca2fbee0155a0")
!95 = !DINamespace(name: "unique", scope: !96)
!96 = !DINamespace(name: "ptr", scope: !14)
!97 = !{!98, !104}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !94, file: !2, baseType: !99, size: 64, align: 64, flags: DIFlagPrivate)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !100, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !101, templateParams: !43, identifier: "80ae125ba1e168585a5b931998775a0e")
!100 = !DINamespace(name: "non_null", scope: !96)
!101 = !{!102}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !99, file: !2, baseType: !103, size: 64, align: 64, flags: DIFlagPrivate)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !94, file: !2, baseType: !105, align: 8, offset: 64, flags: DIFlagPrivate)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !106, file: !2, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !43, identifier: "8d71d2f11c218c0a0fd6dd24e4ec3cb")
!106 = !DINamespace(name: "marker", scope: !14)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !91, file: !2, baseType: !108, size: 64, align: 64, flags: DIFlagPrivate)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !88, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !109, templateParams: !15, identifier: "9978f272e6e1d9a576691aa7d593f946")
!109 = !{!110}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !108, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !91, file: !2, baseType: !112, align: 8, offset: 128, flags: DIFlagPrivate)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !113, file: !2, align: 8, flags: DIFlagPublic, elements: !15, identifier: "ba57508d21470679eff9d8c40fa663d3")
!113 = !DINamespace(name: "alloc", scope: !80)
!114 = !{!115}
!115 = !DITemplateTypeParameter(name: "A", type: !112)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !87, file: !2, baseType: !105, align: 8, offset: 128, flags: DIFlagPrivate)
!117 = !{!44, !115}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!119 = !DIGlobalVariableExpression(var: !120, expr: !DIExpression())
!120 = distinct !DIGlobalVariable(name: "<alloc::boxed::convert::{impl#19}::from::StringError as core::error::Error>::{vtable}", scope: null, file: !2, type: !121, isLocal: true, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::convert::{impl#19}::from::StringError as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !122, vtableHolder: !134, templateParams: !15, identifier: "36d0c5e6ed10e78e301249503d7e38ca")
!122 = !{!123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !121, file: !2, baseType: !6, size: 64, align: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !121, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !121, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !121, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "StringError", scope: !135, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !139, templateParams: !15, identifier: "fd2d19de6640a1ec47e221c68d9f48e9")
!135 = !DINamespace(name: "from", scope: !136)
!136 = !DINamespace(name: "{impl#19}", scope: !137)
!137 = !DINamespace(name: "convert", scope: !138)
!138 = !DINamespace(name: "boxed", scope: !80)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !134, file: !2, baseType: !78, size: 192, align: 64, flags: DIFlagProtected)
!141 = !DIGlobalVariableExpression(var: !142, expr: !DIExpression())
!142 = distinct !DIGlobalVariable(name: "<core::str::error::Utf8Error as core::error::Error>::{vtable}", scope: null, file: !2, type: !143, isLocal: true, isDefinition: true)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::str::error::Utf8Error as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !144, vtableHolder: !156, templateParams: !15, identifier: "7608f514707c4a0dc8d2545ede052db4")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !143, file: !2, baseType: !6, size: 64, align: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !143, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !143, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !143, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !157, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !159, templateParams: !15, identifier: "55056c068c404bb9ec2d5a49832c9a2b")
!157 = !DINamespace(name: "error", scope: !158)
!158 = !DINamespace(name: "str", scope: !14)
!159 = !{!160, !161}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !156, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagProtected)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !156, file: !2, baseType: !36, size: 16, align: 8, offset: 64, flags: DIFlagProtected)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "<&str as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !164, isLocal: true, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !165, vtableHolder: !170, templateParams: !15, identifier: "2ca2f99333556d05226429ca680db30e")
!165 = !{!166, !167, !168, !169}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !164, file: !2, baseType: !6, size: 64, align: 64)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !164, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !164, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !171, templateParams: !15, identifier: "9277eecd40495f85161460476aacc992")
!171 = !{!172, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !170, file: !2, baseType: !173, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64, align: 64, dwarfAddressSpace: 0)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "STATIC_INNER_SLICE", linkageName: "_ZN5alloc4sync18STATIC_INNER_SLICE17h661ba81b17d2f3ceE", scope: !177, file: !178, line: 3479, type: !179, isLocal: false, isDefinition: true, align: 128)
!177 = !DINamespace(name: "sync", scope: !80)
!178 = !DIFile(filename: "src/sync.rs", directory: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/alloc", checksumkind: CSK_MD5, checksum: "6be3b567802e1e824897f02087cdd71b")
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "SliceArcInnerForStatic", scope: !177, file: !2, size: 256, align: 128, flags: DIFlagPrivate, elements: !180, templateParams: !15, identifier: "7c28b90c5326406e15fab3251b5d3e")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !179, file: !2, baseType: !182, size: 192, align: 64, flags: DIFlagPrivate)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<[u8; 1]>", scope: !177, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !183, templateParams: !201, identifier: "685131b1643234746cca70d4bfe5cd7e")
!183 = !{!184, !196, !197}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !182, file: !2, baseType: !185, size: 64, align: 64, flags: DIFlagPrivate)
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !186, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !188, templateParams: !15, identifier: "ca385c94aea77db07e65a571283c8b24")
!186 = !DINamespace(name: "atomic", scope: !187)
!187 = !DINamespace(name: "sync", scope: !14)
!188 = !{!189}
!189 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !185, file: !2, baseType: !190, size: 64, align: 64, flags: DIFlagPrivate)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !191, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !192, templateParams: !194, identifier: "95e322098fe866402ed4197c5c1e0c32")
!191 = !DINamespace(name: "cell", scope: !14)
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !190, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!194 = !{!195}
!195 = !DITemplateTypeParameter(name: "T", type: !9)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !182, file: !2, baseType: !185, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !182, file: !2, baseType: !198, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 8, align: 8, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 1, lowerBound: 0)
!201 = !{!202}
!202 = !DITemplateTypeParameter(name: "T", type: !198)
!203 = !{!"rustc version 1.85.0-nightly (c26db435b 2024-12-15)"}
!204 = !{i32 1, !"target-abi", !"lp64"}
!205 = !{i32 2, !"Dwarf Version", i32 4}
!206 = !{i32 2, !"Debug Info Version", i32 3}
!207 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !208, producer: "clang LLVM (rustc version 1.85.0-nightly (c26db435b 2024-12-15))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !209, globals: !297, splitDebugInlining: false, nameTableKind: None)
!208 = !DIFile(filename: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/alloc/src/lib.rs/@/alloc.db98974eb1e1f83e-cgu.0", directory: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/alloc")
!209 = !{!210, !278, !283, !287, !293}
!210 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum", scope: !211, file: !2, baseType: !212, size: 64, align: 64, flags: DIFlagEnumClass, elements: !213)
!211 = !DINamespace(name: "alignment", scope: !96)
!212 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!213 = !{!214, !215, !216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277}
!214 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!220 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!221 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!222 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!223 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!224 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!225 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!226 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!227 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!228 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!229 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!230 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!231 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!232 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!233 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!234 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!235 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!236 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!237 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!238 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!239 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!240 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!241 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!242 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!243 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!244 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!245 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!246 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!247 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!248 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!249 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!250 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!251 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!252 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!253 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!254 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!255 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!256 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!257 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!258 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!259 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!260 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!261 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!262 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!263 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!264 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!265 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!266 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!267 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!268 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!269 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!270 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!271 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!272 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!273 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!274 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!275 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!276 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!277 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!278 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !13, file: !2, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !279)
!279 = !{!280, !281, !282}
!280 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!281 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!282 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!283 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !284, file: !2, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !285)
!284 = !DINamespace(name: "rt", scope: !13)
!285 = !{!280, !281, !282, !286}
!286 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!287 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !288, file: !2, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !289)
!288 = !DINamespace(name: "panicking", scope: !14)
!289 = !{!290, !291, !292}
!290 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!291 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!292 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!293 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !88, file: !2, baseType: !45, size: 8, align: 8, flags: DIFlagEnumClass, elements: !294)
!294 = !{!295, !296}
!295 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!296 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!297 = !{!0, !16, !27, !51, !59, !68, !119, !141, !162, !175}
!298 = distinct !DISubprogram(name: "fold<char, core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h003b1cf887d8a7f1E", scope: !300, file: !299, line: 124, type: !304, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !377, retainedNodes: !373)
!299 = !DIFile(filename: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/core/src/iter/adapters/map.rs", directory: "", checksumkind: CSK_MD5, checksum: "47fd4c3c8424e034238ec6bb5a169812")
!300 = !DINamespace(name: "{impl#2}", scope: !301)
!301 = !DINamespace(name: "map", scope: !302)
!302 = !DINamespace(name: "adapters", scope: !303)
!303 = !DINamespace(name: "iter", scope: !14)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306, !7, !359}
!306 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>", scope: !301, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !307, templateParams: !356, identifier: "4aad6047b70ec19fa5778793d237e14")
!307 = !{!308, !352}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !306, file: !2, baseType: !309, size: 192, align: 64, flags: DIFlagProtected)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>", scope: !310, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !312, templateParams: !350, identifier: "d9bafcad918b471cf8579ab4d6223f0b")
!310 = !DINamespace(name: "decode", scope: !311)
!311 = !DINamespace(name: "char", scope: !14)
!312 = !{!313, !338}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !309, file: !2, baseType: !314, size: 128, align: 64, flags: DIFlagPrivate)
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cloned<core::slice::iter::Iter<u16>>", scope: !315, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !316, templateParams: !336, identifier: "7af29f51737b84a2aafd11b4938fa597")
!315 = !DINamespace(name: "cloned", scope: !302)
!316 = !{!317}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !314, file: !2, baseType: !318, size: 128, align: 64, flags: DIFlagPrivate)
!318 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u16>", scope: !319, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !321, templateParams: !328, identifier: "2aa791fc0cee8e6a4424c6c5043bbfbf")
!319 = !DINamespace(name: "iter", scope: !320)
!320 = !DINamespace(name: "slice", scope: !14)
!321 = !{!322, !330, !331}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !318, file: !2, baseType: !323, size: 64, align: 64, flags: DIFlagPrivate)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u16>", scope: !100, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !324, templateParams: !328, identifier: "e0fec20ac71245ae6c5f61dc199610fd")
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !323, file: !2, baseType: !326, size: 64, align: 64, flags: DIFlagPrivate)
!326 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u16", baseType: !327, size: 64, align: 64, dwarfAddressSpace: 0)
!327 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!328 = !{!329}
!329 = !DITemplateTypeParameter(name: "T", type: !327)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !318, file: !2, baseType: !326, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !318, file: !2, baseType: !332, align: 8, offset: 128, flags: DIFlagPrivate)
!332 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u16>", scope: !106, file: !2, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !333, identifier: "1cb84533730f4ac55fdc5d36c9b3a07")
!333 = !{!334}
!334 = !DITemplateTypeParameter(name: "T", type: !335)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u16", baseType: !327, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !{!337}
!337 = !DITemplateTypeParameter(name: "I", type: !318)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !309, file: !2, baseType: !339, size: 32, align: 16, offset: 128, flags: DIFlagPrivate)
!339 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u16>", scope: !37, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !340, templateParams: !15, identifier: "154332e04d6aba443f9fa47743c46d22")
!340 = !{!341}
!341 = !DICompositeType(tag: DW_TAG_variant_part, scope: !339, file: !2, size: 32, align: 16, elements: !342, templateParams: !15, identifier: "8fa24e1f2baf16866ae0988b9a9601e8", discriminator: !349)
!342 = !{!343, !345}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !341, file: !2, baseType: !344, size: 32, align: 16, extraData: i128 0)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !339, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !15, templateParams: !328, identifier: "fe51a068183a0a6085b2c83917d0519f")
!345 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !341, file: !2, baseType: !346, size: 32, align: 16, extraData: i128 1)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !339, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !347, templateParams: !328, identifier: "2cdcbc76861ba8039c7ace7a5365d321")
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !346, file: !2, baseType: !327, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!349 = !DIDerivedType(tag: DW_TAG_member, scope: !339, file: !2, baseType: !327, size: 16, align: 16, flags: DIFlagArtificial)
!350 = !{!351}
!351 = !DITemplateTypeParameter(name: "I", type: !314)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !306, file: !2, baseType: !353, align: 8, offset: 192, flags: DIFlagPrivate)
!353 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !354, file: !2, align: 8, elements: !15, identifier: "59915c46f61ca90589c4180b8c621e17")
!354 = !DINamespace(name: "from_utf16_lossy", scope: !355)
!355 = !DINamespace(name: "{impl#0}", scope: !79)
!356 = !{!357, !358}
!357 = !DITemplateTypeParameter(name: "I", type: !309)
!358 = !DITemplateTypeParameter(name: "F", type: !353)
!359 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>>>", scope: !360, file: !2, size: 64, align: 64, elements: !365, templateParams: !15, identifier: "6853fd758cc9132dfd5116f2e2191266")
!360 = !DINamespace(name: "call", scope: !361)
!361 = !DINamespace(name: "for_each", scope: !362)
!362 = !DINamespace(name: "Iterator", scope: !363)
!363 = !DINamespace(name: "iterator", scope: !364)
!364 = !DINamespace(name: "traits", scope: !303)
!365 = !{!366}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !359, file: !2, baseType: !367, size: 64, align: 64)
!367 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>>", scope: !368, file: !2, size: 64, align: 64, elements: !370, templateParams: !15, identifier: "b181d271bc36358fc2ed44929499ced")
!368 = !DINamespace(name: "extend", scope: !369)
!369 = !DINamespace(name: "{impl#13}", scope: !79)
!370 = !{!371}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !367, file: !2, baseType: !372, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!373 = !{!374, !375, !376}
!374 = !DILocalVariable(name: "self", arg: 1, scope: !298, file: !299, line: 124, type: !306)
!375 = !DILocalVariable(name: "init", arg: 2, scope: !298, file: !299, line: 124, type: !7)
!376 = !DILocalVariable(name: "g", arg: 3, scope: !298, file: !299, line: 124, type: !359)
!377 = !{!378, !357, !358, !380, !381}
!378 = !DITemplateTypeParameter(name: "B", type: !379)
!379 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!380 = !DITemplateTypeParameter(name: "Acc", type: !7)
!381 = !DITemplateTypeParameter(name: "G", type: !359)
!382 = !DILocation(line: 124, column: 21, scope: !298)
!383 = !DILocation(line: 124, column: 27, scope: !298)
!384 = !DILocation(line: 124, column: 38, scope: !298)
!385 = !DILocation(line: 128, column: 9, scope: !298)
!386 = !DILocation(line: 128, column: 30, scope: !298)
!387 = !DILocation(line: 129, column: 6, scope: !298)
!388 = distinct !DISubprogram(name: "fold<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h0479151a0823b3f7E", scope: !300, file: !299, line: 124, type: !389, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !459, retainedNodes: !455)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !391, !7, !449}
!391 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>", scope: !301, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !392, templateParams: !446, identifier: "5ccb7576028f8588718c2eee901708f4")
!392 = !{!393, !443}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !391, file: !2, baseType: !394, size: 128, align: 64, flags: DIFlagProtected)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>", scope: !310, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !395, templateParams: !441, identifier: "24d947e66bbefeaf5897af30cdf4cb76")
!395 = !{!396, !440}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !394, file: !2, baseType: !397, size: 64, align: 64, flags: DIFlagPrivate)
!397 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", scope: !301, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !398, templateParams: !437, identifier: "aafeb66688d3b6f09ece9fea517a47d2")
!398 = !{!399, !433}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !397, file: !2, baseType: !400, size: 64, align: 64, flags: DIFlagProtected)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>", scope: !401, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !431, identifier: "863f1a63af63f8ea133ba54534d310c1")
!401 = !DINamespace(name: "copied", scope: !302)
!402 = !{!403}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !400, file: !2, baseType: !404, size: 64, align: 64, flags: DIFlagPrivate)
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::slice::iter::ArrayChunks<u8, 2>", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!405 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArrayChunks<u8, 2>", scope: !319, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !406, templateParams: !43, identifier: "d94f6339d5fc600692af2cce53c1e90f")
!406 = !{!407, !426}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !405, file: !2, baseType: !408, size: 128, align: 64, flags: DIFlagPrivate)
!408 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<[u8; 2]>", scope: !319, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !409, templateParams: !418, identifier: "e072c42163525fd1a5eadeb2cabd4994")
!409 = !{!410, !420, !421}
!410 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !408, file: !2, baseType: !411, size: 64, align: 64, flags: DIFlagPrivate)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<[u8; 2]>", scope: !100, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !412, templateParams: !418, identifier: "3199d0e4ec7110e934df8329834559dc")
!412 = !{!413}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !411, file: !2, baseType: !414, size: 64, align: 64, flags: DIFlagPrivate)
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const [u8; 2]", baseType: !415, size: 64, align: 64, dwarfAddressSpace: 0)
!415 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 16, align: 8, elements: !416)
!416 = !{!417}
!417 = !DISubrange(count: 2, lowerBound: 0)
!418 = !{!419}
!419 = !DITemplateTypeParameter(name: "T", type: !415)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !408, file: !2, baseType: !414, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !408, file: !2, baseType: !422, align: 8, offset: 128, flags: DIFlagPrivate)
!422 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&[u8; 2]>", scope: !106, file: !2, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !423, identifier: "9f7726e9a4c0a6265c599e7d27b315bf")
!423 = !{!424}
!424 = !DITemplateTypeParameter(name: "T", type: !425)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[u8; 2]", baseType: !415, size: 64, align: 64, dwarfAddressSpace: 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !405, file: !2, baseType: !427, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!427 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !428, templateParams: !15, identifier: "31681e0c10b314f1f33e38b2779acbb4")
!428 = !{!429, !430}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !427, file: !2, baseType: !173, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !427, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!431 = !{!432}
!432 = !DITemplateTypeParameter(name: "I", type: !404)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !397, file: !2, baseType: !434, align: 8, offset: 64, flags: DIFlagPrivate)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn([u8; 2]) -> u16", baseType: !435, align: 1, dwarfAddressSpace: 0)
!435 = !DISubroutineType(types: !436)
!436 = !{!327, !415}
!437 = !{!438, !439}
!438 = !DITemplateTypeParameter(name: "I", type: !400)
!439 = !DITemplateTypeParameter(name: "F", type: !434)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !394, file: !2, baseType: !339, size: 32, align: 16, offset: 64, flags: DIFlagPrivate)
!441 = !{!442}
!442 = !DITemplateTypeParameter(name: "I", type: !397)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !391, file: !2, baseType: !444, align: 8, offset: 128, flags: DIFlagPrivate)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !445, file: !2, align: 8, elements: !15, identifier: "64c7308ff8a184e5af0ba3fb8b97a37e")
!445 = !DINamespace(name: "from_utf16be_lossy", scope: !355)
!446 = !{!447, !448}
!447 = !DITemplateTypeParameter(name: "I", type: !394)
!448 = !DITemplateTypeParameter(name: "F", type: !444)
!449 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>>>", scope: !360, file: !2, size: 64, align: 64, elements: !450, templateParams: !15, identifier: "c8601fed03ccc3077062ee698da98bd7")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !449, file: !2, baseType: !452, size: 64, align: 64)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>>", scope: !368, file: !2, size: 64, align: 64, elements: !453, templateParams: !15, identifier: "a14ca6e1f74b074651f25f19e4c4cf26")
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !452, file: !2, baseType: !372, size: 64, align: 64)
!455 = !{!456, !457, !458}
!456 = !DILocalVariable(name: "self", arg: 1, scope: !388, file: !299, line: 124, type: !391)
!457 = !DILocalVariable(name: "init", arg: 2, scope: !388, file: !299, line: 124, type: !7)
!458 = !DILocalVariable(name: "g", arg: 3, scope: !388, file: !299, line: 124, type: !449)
!459 = !{!378, !447, !448, !380, !460}
!460 = !DITemplateTypeParameter(name: "G", type: !449)
!461 = !DILocation(line: 124, column: 21, scope: !388)
!462 = !DILocation(line: 124, column: 27, scope: !388)
!463 = !DILocation(line: 124, column: 38, scope: !388)
!464 = !DILocation(line: 128, column: 9, scope: !388)
!465 = !DILocation(line: 128, column: 30, scope: !388)
!466 = !DILocation(line: 129, column: 6, scope: !388)
!467 = distinct !DISubprogram(name: "fold<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h9531550f4ac50ad4E", scope: !300, file: !299, line: 124, type: !468, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !499, retainedNodes: !495)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !470, !7, !489}
!470 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>", scope: !301, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !471, templateParams: !486, identifier: "2ac4b57a07ec1000d25cc4574b498aa4")
!471 = !{!472, !483}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !470, file: !2, baseType: !473, size: 128, align: 64, flags: DIFlagProtected)
!473 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>", scope: !310, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !474, templateParams: !481, identifier: "bfe93bf4584a460db55f4bdb8fb884ab")
!474 = !{!475, !480}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !473, file: !2, baseType: !476, size: 64, align: 64, flags: DIFlagPrivate)
!476 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", scope: !301, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !477, templateParams: !437, identifier: "4bd0566fdca909ed23ec3714e0c1e11")
!477 = !{!478, !479}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !476, file: !2, baseType: !400, size: 64, align: 64, flags: DIFlagProtected)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !476, file: !2, baseType: !434, align: 8, offset: 64, flags: DIFlagPrivate)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !473, file: !2, baseType: !339, size: 32, align: 16, offset: 64, flags: DIFlagPrivate)
!481 = !{!482}
!482 = !DITemplateTypeParameter(name: "I", type: !476)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !470, file: !2, baseType: !484, align: 8, offset: 128, flags: DIFlagPrivate)
!484 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !485, file: !2, align: 8, elements: !15, identifier: "bceb1d2190eb70cf6b05e6a3e1fc5a40")
!485 = !DINamespace(name: "from_utf16le_lossy", scope: !355)
!486 = !{!487, !488}
!487 = !DITemplateTypeParameter(name: "I", type: !473)
!488 = !DITemplateTypeParameter(name: "F", type: !484)
!489 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>>>", scope: !360, file: !2, size: 64, align: 64, elements: !490, templateParams: !15, identifier: "f4d7fe129feda82fdc9d426261393b2d")
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !489, file: !2, baseType: !492, size: 64, align: 64)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>>", scope: !368, file: !2, size: 64, align: 64, elements: !493, templateParams: !15, identifier: "e723c78b39ae8ddeb34c970627aa943a")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "self", scope: !492, file: !2, baseType: !372, size: 64, align: 64)
!495 = !{!496, !497, !498}
!496 = !DILocalVariable(name: "self", arg: 1, scope: !467, file: !299, line: 124, type: !470)
!497 = !DILocalVariable(name: "init", arg: 2, scope: !467, file: !299, line: 124, type: !7)
!498 = !DILocalVariable(name: "g", arg: 3, scope: !467, file: !299, line: 124, type: !489)
!499 = !{!378, !487, !488, !380, !500}
!500 = !DITemplateTypeParameter(name: "G", type: !489)
!501 = !DILocation(line: 124, column: 21, scope: !467)
!502 = !DILocation(line: 124, column: 27, scope: !467)
!503 = !DILocation(line: 124, column: 38, scope: !467)
!504 = !DILocation(line: 128, column: 9, scope: !467)
!505 = !DILocation(line: 128, column: 30, scope: !467)
!506 = !DILocation(line: 129, column: 6, scope: !467)
!507 = distinct !DISubprogram(name: "fold<u8, core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}, u8, core::iter::traits::accum::{impl#28}::sum::{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17hbae18a08927bccfcE", scope: !300, file: !299, line: 124, type: !508, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !544, retainedNodes: !540)
!508 = !DISubroutineType(types: !509)
!509 = !{!45, !510, !45, !536}
!510 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}>", scope: !301, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !511, templateParams: !533, identifier: "add041827a17597026af54547419a446")
!511 = !{!512, !529}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !510, file: !2, baseType: !513, size: 128, align: 64, flags: DIFlagProtected)
!513 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<bool>", scope: !319, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !514, templateParams: !521, identifier: "65fe84ccc8137f8e234f021cdc49caf0")
!514 = !{!515, !523, !524}
!515 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !513, file: !2, baseType: !516, size: 64, align: 64, flags: DIFlagPrivate)
!516 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<bool>", scope: !100, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !517, templateParams: !521, identifier: "63a9c3899a0878b39d720e426ee09c23")
!517 = !{!518}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !516, file: !2, baseType: !519, size: 64, align: 64, flags: DIFlagPrivate)
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const bool", baseType: !520, size: 64, align: 64, dwarfAddressSpace: 0)
!520 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!521 = !{!522}
!522 = !DITemplateTypeParameter(name: "T", type: !520)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !513, file: !2, baseType: !519, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !513, file: !2, baseType: !525, align: 8, offset: 128, flags: DIFlagPrivate)
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&bool>", scope: !106, file: !2, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !526, identifier: "9752d37f2dede4ef560f1ce1d6ea607a")
!526 = !{!527}
!527 = !DITemplateTypeParameter(name: "T", type: !528)
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&bool", baseType: !520, size: 64, align: 64, dwarfAddressSpace: 0)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !510, file: !2, baseType: !530, align: 8, offset: 128, flags: DIFlagPrivate)
!530 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !531, file: !2, align: 8, elements: !15, identifier: "b00e33f3074b95e1965747a9ed77396c")
!531 = !DINamespace(name: "convert_while_ascii", scope: !532)
!532 = !DINamespace(name: "str", scope: !80)
!533 = !{!534, !535}
!534 = !DITemplateTypeParameter(name: "I", type: !513)
!535 = !DITemplateTypeParameter(name: "F", type: !530)
!536 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<bool>, alloc::str::convert_while_ascii::{closure_env#0}>>", scope: !537, file: !2, align: 8, elements: !15, identifier: "eccc954ebd0819249c83fbd8002b9855")
!537 = !DINamespace(name: "sum", scope: !538)
!538 = !DINamespace(name: "{impl#28}", scope: !539)
!539 = !DINamespace(name: "accum", scope: !364)
!540 = !{!541, !542, !543}
!541 = !DILocalVariable(name: "self", arg: 1, scope: !507, file: !299, line: 124, type: !510)
!542 = !DILocalVariable(name: "init", arg: 2, scope: !507, file: !299, line: 124, type: !45)
!543 = !DILocalVariable(name: "g", arg: 3, scope: !507, file: !299, line: 124, type: !536)
!544 = !{!545, !534, !535, !546, !547}
!545 = !DITemplateTypeParameter(name: "B", type: !45)
!546 = !DITemplateTypeParameter(name: "Acc", type: !45)
!547 = !DITemplateTypeParameter(name: "G", type: !536)
!548 = !DILocation(line: 124, column: 21, scope: !507)
!549 = !DILocation(line: 124, column: 27, scope: !507)
!550 = !DILocation(line: 124, column: 38, scope: !507)
!551 = !DILocation(line: 128, column: 30, scope: !507)
!552 = !DILocation(line: 128, column: 9, scope: !507)
!553 = !DILocation(line: 129, column: 6, scope: !507)
!554 = distinct !DISubprogram(name: "fold<usize, core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}, usize, core::iter::traits::accum::{impl#48}::sum::{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>>>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17hdbff830f5d3b66aaE", scope: !300, file: !299, line: 124, type: !555, scopeLine: 124, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !589, retainedNodes: !585)
!555 = !DISubroutineType(types: !556)
!556 = !{!9, !557, !9, !582}
!557 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>", scope: !301, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !558, templateParams: !579, identifier: "862c96185e905bdc25f9d5621425d9fe")
!558 = !{!559, !575}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !557, file: !2, baseType: !560, size: 128, align: 64, flags: DIFlagProtected)
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<&str>", scope: !319, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !561, templateParams: !567, identifier: "d7951a08f901cc485797366bf00b985c")
!561 = !{!562, !569, !570}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !560, file: !2, baseType: !563, size: 64, align: 64, flags: DIFlagPrivate)
!563 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<&str>", scope: !100, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !564, templateParams: !567, identifier: "816d12818e1d0179547036db0045f849")
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !563, file: !2, baseType: !566, size: 64, align: 64, flags: DIFlagPrivate)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const &str", baseType: !170, size: 64, align: 64, dwarfAddressSpace: 0)
!567 = !{!568}
!568 = !DITemplateTypeParameter(name: "T", type: !170)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !560, file: !2, baseType: !566, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !560, file: !2, baseType: !571, align: 8, offset: 128, flags: DIFlagPrivate)
!571 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&&str>", scope: !106, file: !2, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !572, identifier: "6ee690f8bb445a40a4a03c99ccd3c155")
!572 = !{!573}
!573 = !DITemplateTypeParameter(name: "T", type: !574)
!574 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&str", baseType: !170, size: 64, align: 64, dwarfAddressSpace: 0)
!575 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !557, file: !2, baseType: !576, align: 8, offset: 128, flags: DIFlagPrivate)
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !577, file: !2, align: 8, elements: !15, identifier: "4a8ae1112415dba488eadf7eccdfebed")
!577 = !DINamespace(name: "estimated_capacity", scope: !578)
!578 = !DINamespace(name: "{impl#4}", scope: !13)
!579 = !{!580, !581}
!580 = !DITemplateTypeParameter(name: "I", type: !560)
!581 = !DITemplateTypeParameter(name: "F", type: !576)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<core::iter::adapters::map::Map<core::slice::iter::Iter<&str>, core::fmt::{impl#4}::estimated_capacity::{closure_env#0}>>", scope: !583, file: !2, align: 8, elements: !15, identifier: "73b314cb7cb4d17c7a585eaf83f11a4f")
!583 = !DINamespace(name: "sum", scope: !584)
!584 = !DINamespace(name: "{impl#48}", scope: !539)
!585 = !{!586, !587, !588}
!586 = !DILocalVariable(name: "self", arg: 1, scope: !554, file: !299, line: 124, type: !557)
!587 = !DILocalVariable(name: "init", arg: 2, scope: !554, file: !299, line: 124, type: !9)
!588 = !DILocalVariable(name: "g", arg: 3, scope: !554, file: !299, line: 124, type: !582)
!589 = !{!590, !580, !581, !591, !592}
!590 = !DITemplateTypeParameter(name: "B", type: !9)
!591 = !DITemplateTypeParameter(name: "Acc", type: !9)
!592 = !DITemplateTypeParameter(name: "G", type: !582)
!593 = !DILocation(line: 124, column: 21, scope: !554)
!594 = !DILocation(line: 124, column: 27, scope: !554)
!595 = !DILocation(line: 124, column: 38, scope: !554)
!596 = !DILocation(line: 128, column: 30, scope: !554)
!597 = !DILocation(line: 128, column: 9, scope: !554)
!598 = !DILocation(line: 129, column: 6, scope: !554)
!599 = distinct !DISubprogram(name: "next<u16, core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h68119ae6bd8b6adcE", scope: !300, file: !299, line: 106, type: !600, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !605, retainedNodes: !603)
!600 = !DISubroutineType(types: !601)
!601 = !{!339, !602}
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !397, size: 64, align: 64, dwarfAddressSpace: 0)
!603 = !{!604}
!604 = !DILocalVariable(name: "self", arg: 1, scope: !599, file: !299, line: 106, type: !602)
!605 = !{!606, !438, !439}
!606 = !DITemplateTypeParameter(name: "B", type: !327)
!607 = !DILocation(line: 106, column: 13, scope: !599)
!608 = !DILocation(line: 107, column: 9, scope: !599)
!609 = !DILocation(line: 107, column: 30, scope: !599)
!610 = !DILocation(line: 108, column: 6, scope: !599)
!611 = distinct !DISubprogram(name: "next<u16, core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hb76c32654efa819eE", scope: !300, file: !299, line: 106, type: !612, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !628, retainedNodes: !626)
!612 = !DISubroutineType(types: !613)
!613 = !{!339, !614}
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!615 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", scope: !301, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !616, templateParams: !624, identifier: "c9a5a23dee5df0616a28da450c271cc")
!616 = !{!617, !623}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !615, file: !2, baseType: !618, size: 256, align: 64, flags: DIFlagProtected)
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "Copied<core::slice::iter::ArrayChunks<u8, 2>>", scope: !401, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !619, templateParams: !621, identifier: "83876302da5631e6801324bcf780201f")
!619 = !{!620}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "it", scope: !618, file: !2, baseType: !405, size: 256, align: 64, flags: DIFlagPrivate)
!621 = !{!622}
!622 = !DITemplateTypeParameter(name: "I", type: !405)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !615, file: !2, baseType: !434, align: 8, offset: 256, flags: DIFlagPrivate)
!624 = !{!625, !439}
!625 = !DITemplateTypeParameter(name: "I", type: !618)
!626 = !{!627}
!627 = !DILocalVariable(name: "self", arg: 1, scope: !611, file: !299, line: 106, type: !614)
!628 = !{!606, !625, !439}
!629 = !DILocation(line: 106, column: 13, scope: !611)
!630 = !DILocation(line: 107, column: 9, scope: !611)
!631 = !DILocation(line: 107, column: 30, scope: !611)
!632 = !DILocation(line: 108, column: 6, scope: !611)
!633 = distinct !DISubprogram(name: "next<u16, core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hcc9d1d3d9e012ba6E", scope: !300, file: !299, line: 106, type: !634, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !628, retainedNodes: !641)
!634 = !DISubroutineType(types: !635)
!635 = !{!339, !636}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !637, size: 64, align: 64, dwarfAddressSpace: 0)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", scope: !301, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !638, templateParams: !624, identifier: "6ae880fceb8631a8a6a66da4bf5a39a9")
!638 = !{!639, !640}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !637, file: !2, baseType: !618, size: 256, align: 64, flags: DIFlagProtected)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !637, file: !2, baseType: !434, align: 8, offset: 256, flags: DIFlagPrivate)
!641 = !{!642}
!642 = !DILocalVariable(name: "self", arg: 1, scope: !633, file: !299, line: 106, type: !636)
!643 = !DILocation(line: 106, column: 13, scope: !633)
!644 = !DILocation(line: 107, column: 9, scope: !633)
!645 = !DILocation(line: 107, column: 30, scope: !633)
!646 = !DILocation(line: 108, column: 6, scope: !633)
!647 = distinct !DISubprogram(name: "next<u16, core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hcece374a8b7cd35fE", scope: !300, file: !299, line: 106, type: !648, scopeLine: 106, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !605, retainedNodes: !651)
!648 = !DISubroutineType(types: !649)
!649 = !{!339, !650}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !476, size: 64, align: 64, dwarfAddressSpace: 0)
!651 = !{!652}
!652 = !DILocalVariable(name: "self", arg: 1, scope: !647, file: !299, line: 106, type: !650)
!653 = !DILocation(line: 106, column: 13, scope: !647)
!654 = !DILocation(line: 107, column: 9, scope: !647)
!655 = !DILocation(line: 107, column: 30, scope: !647)
!656 = !DILocation(line: 108, column: 6, scope: !647)
!657 = distinct !DISubprogram(name: "size_hint<u16, core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h162fd55153b4dc0dE", scope: !300, file: !299, line: 111, type: !658, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !605, retainedNodes: !676)
!658 = !DISubroutineType(types: !659)
!659 = !{!660, !675}
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, core::option::Option<usize>)", file: !2, size: 192, align: 64, elements: !661, templateParams: !15, identifier: "8b57707d3cefca1d6351e45655c9b480")
!661 = !{!662, !663}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !660, file: !2, baseType: !9, size: 64, align: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !660, file: !2, baseType: !664, size: 128, align: 64, offset: 64)
!664 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !37, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !665, templateParams: !15, identifier: "668838b1d8ded1c93b7e8789c94da2d1")
!665 = !{!666}
!666 = !DICompositeType(tag: DW_TAG_variant_part, scope: !664, file: !2, size: 128, align: 64, elements: !667, templateParams: !15, identifier: "3f0499d6b32debe5137afabbbd84fc1", discriminator: !674)
!667 = !{!668, !670}
!668 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !666, file: !2, baseType: !669, size: 128, align: 64, extraData: i128 0)
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !664, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !15, templateParams: !194, identifier: "8d0b5136c2bc787812b6386036a43f1e")
!670 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !666, file: !2, baseType: !671, size: 128, align: 64, extraData: i128 1)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !664, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !672, templateParams: !194, identifier: "7aecd3dec99cd22a234004f750ec8ffd")
!672 = !{!673}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !671, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!674 = !DIDerivedType(tag: DW_TAG_member, scope: !664, file: !2, baseType: !212, size: 64, align: 64, flags: DIFlagArtificial)
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !476, size: 64, align: 64, dwarfAddressSpace: 0)
!676 = !{!677}
!677 = !DILocalVariable(name: "self", arg: 1, scope: !657, file: !299, line: 111, type: !675)
!678 = !DILocation(line: 111, column: 18, scope: !657)
!679 = !DILocation(line: 112, column: 9, scope: !657)
!680 = !DILocation(line: 113, column: 6, scope: !657)
!681 = distinct !DISubprogram(name: "size_hint<u16, core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h56381cb01a7560a8E", scope: !300, file: !299, line: 111, type: !682, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !628, retainedNodes: !685)
!682 = !DISubroutineType(types: !683)
!683 = !{!660, !684}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !637, size: 64, align: 64, dwarfAddressSpace: 0)
!685 = !{!686}
!686 = !DILocalVariable(name: "self", arg: 1, scope: !681, file: !299, line: 111, type: !684)
!687 = !DILocation(line: 111, column: 18, scope: !681)
!688 = !DILocation(line: 112, column: 9, scope: !681)
!689 = !DILocation(line: 113, column: 6, scope: !681)
!690 = distinct !DISubprogram(name: "size_hint<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h7a8fb8088cec46bcE", scope: !300, file: !299, line: 111, type: !691, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !696, retainedNodes: !694)
!691 = !DISubroutineType(types: !692)
!692 = !{!660, !693}
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16le_lossy::{closure_env#0}>", baseType: !470, size: 64, align: 64, dwarfAddressSpace: 0)
!694 = !{!695}
!695 = !DILocalVariable(name: "self", arg: 1, scope: !690, file: !299, line: 111, type: !693)
!696 = !{!378, !487, !488}
!697 = !DILocation(line: 111, column: 18, scope: !690)
!698 = !DILocation(line: 112, column: 9, scope: !690)
!699 = !DILocation(line: 113, column: 6, scope: !690)
!700 = distinct !DISubprogram(name: "size_hint<char, core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h872aa59146a7cfa9E", scope: !300, file: !299, line: 111, type: !701, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !706, retainedNodes: !704)
!701 = !DISubroutineType(types: !702)
!702 = !{!660, !703}
!703 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, alloc::string::{impl#0}::from_utf16be_lossy::{closure_env#0}>", baseType: !391, size: 64, align: 64, dwarfAddressSpace: 0)
!704 = !{!705}
!705 = !DILocalVariable(name: "self", arg: 1, scope: !700, file: !299, line: 111, type: !703)
!706 = !{!378, !447, !448}
!707 = !DILocation(line: 111, column: 18, scope: !700)
!708 = !DILocation(line: 112, column: 9, scope: !700)
!709 = !DILocation(line: 113, column: 6, scope: !700)
!710 = distinct !DISubprogram(name: "size_hint<u16, core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h93fc57080880152fE", scope: !300, file: !299, line: 111, type: !711, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !628, retainedNodes: !714)
!711 = !DISubroutineType(types: !712)
!712 = !{!660, !713}
!713 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !615, size: 64, align: 64, dwarfAddressSpace: 0)
!714 = !{!715}
!715 = !DILocalVariable(name: "self", arg: 1, scope: !710, file: !299, line: 111, type: !713)
!716 = !DILocation(line: 111, column: 18, scope: !710)
!717 = !DILocation(line: 112, column: 9, scope: !710)
!718 = !DILocation(line: 113, column: 6, scope: !710)
!719 = distinct !DISubprogram(name: "size_hint<u16, core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17heb596a49b23f6739E", scope: !300, file: !299, line: 111, type: !720, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !605, retainedNodes: !723)
!720 = !DISubroutineType(types: !721)
!721 = !{!660, !722}
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>", baseType: !397, size: 64, align: 64, dwarfAddressSpace: 0)
!723 = !{!724}
!724 = !DILocalVariable(name: "self", arg: 1, scope: !719, file: !299, line: 111, type: !722)
!725 = !DILocation(line: 111, column: 18, scope: !719)
!726 = !DILocation(line: 112, column: 9, scope: !719)
!727 = !DILocation(line: 113, column: 6, scope: !719)
!728 = distinct !DISubprogram(name: "size_hint<char, core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>", linkageName: "_ZN102_$LT$core..iter..adapters..map..Map$LT$I$C$F$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17hf81945ef99946e86E", scope: !300, file: !299, line: 111, type: !729, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !734, retainedNodes: !732)
!729 = !DISubroutineType(types: !730)
!730 = !{!660, !731}
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::map::Map<core::char::decode::DecodeUtf16<core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>>, alloc::string::{impl#0}::from_utf16_lossy::{closure_env#0}>", baseType: !306, size: 64, align: 64, dwarfAddressSpace: 0)
!732 = !{!733}
!733 = !DILocalVariable(name: "self", arg: 1, scope: !728, file: !299, line: 111, type: !731)
!734 = !{!378, !357, !358}
!735 = !DILocation(line: 111, column: 18, scope: !728)
!736 = !DILocation(line: 112, column: 9, scope: !728)
!737 = !DILocation(line: 113, column: 6, scope: !728)
!738 = distinct !DISubprogram(name: "next<u8, 2>", linkageName: "_ZN102_$LT$core..slice..iter..ArrayChunks$LT$T$C$_$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h6e993169ed0301a1E", scope: !740, file: !739, line: 2363, type: !741, scopeLine: 2363, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !43, retainedNodes: !754)
!739 = !DIFile(filename: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "95196014cc01538cc27e1b3113c17ffb")
!740 = !DINamespace(name: "{impl#113}", scope: !319)
!741 = !DISubroutineType(types: !742)
!742 = !{!743, !404}
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[u8; 2]>", scope: !37, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !744, templateParams: !15, identifier: "292a2a959715145191eac13f05c2e45d")
!744 = !{!745}
!745 = !DICompositeType(tag: DW_TAG_variant_part, scope: !743, file: !2, size: 64, align: 64, elements: !746, templateParams: !15, identifier: "a87151522e6999b79a4c06942f899e6f", discriminator: !753)
!746 = !{!747, !749}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !745, file: !2, baseType: !748, size: 64, align: 64, extraData: i128 0)
!748 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !743, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !15, templateParams: !423, identifier: "ddc502b9ae92375d589c8d43ab895cea")
!749 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !745, file: !2, baseType: !750, size: 64, align: 64)
!750 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !743, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !751, templateParams: !423, identifier: "256a282dbe99af777d748ab2aa4cc3b7")
!751 = !{!752}
!752 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !750, file: !2, baseType: !425, size: 64, align: 64, flags: DIFlagPublic)
!753 = !DIDerivedType(tag: DW_TAG_member, scope: !743, file: !2, baseType: !212, size: 64, align: 64, flags: DIFlagArtificial)
!754 = !{!755}
!755 = !DILocalVariable(name: "self", arg: 1, scope: !738, file: !739, line: 2363, type: !404)
!756 = !DILocation(line: 2363, column: 13, scope: !738)
!757 = !DILocation(line: 2364, column: 9, scope: !738)
!758 = !DILocation(line: 2365, column: 6, scope: !738)
!759 = distinct !DISubprogram(name: "size_hint<u8, 2>", linkageName: "_ZN102_$LT$core..slice..iter..ArrayChunks$LT$T$C$_$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h4f47c3f8dfce9377E", scope: !740, file: !739, line: 2368, type: !760, scopeLine: 2368, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !43, retainedNodes: !763)
!760 = !DISubroutineType(types: !761)
!761 = !{!660, !762}
!762 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::slice::iter::ArrayChunks<u8, 2>", baseType: !405, size: 64, align: 64, dwarfAddressSpace: 0)
!763 = !{!764}
!764 = !DILocalVariable(name: "self", arg: 1, scope: !759, file: !739, line: 2368, type: !762)
!765 = !DILocation(line: 2368, column: 18, scope: !759)
!766 = !DILocation(line: 2369, column: 9, scope: !759)
!767 = !DILocation(line: 2370, column: 6, scope: !759)
!768 = distinct !DISubprogram(name: "next<core::slice::iter::Iter<u16>, u16>", linkageName: "_ZN104_$LT$core..iter..adapters..cloned..Cloned$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17hff3ac44154215173E", scope: !770, file: !769, line: 40, type: !771, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !776, retainedNodes: !774)
!769 = !DIFile(filename: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/core/src/iter/adapters/cloned.rs", directory: "", checksumkind: CSK_MD5, checksum: "bfed33096282515437a01f48265c2199")
!770 = !DINamespace(name: "{impl#1}", scope: !315)
!771 = !DISubroutineType(types: !772)
!772 = !{!339, !773}
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>", baseType: !314, size: 64, align: 64, dwarfAddressSpace: 0)
!774 = !{!775}
!775 = !DILocalVariable(name: "self", arg: 1, scope: !768, file: !769, line: 40, type: !773)
!776 = !{!337, !329}
!777 = !DILocation(line: 40, column: 13, scope: !768)
!778 = !DILocation(line: 41, column: 9, scope: !768)
!779 = !DILocation(line: 42, column: 6, scope: !768)
!780 = distinct !DISubprogram(name: "size_hint<core::slice::iter::Iter<u16>, u16>", linkageName: "_ZN104_$LT$core..iter..adapters..cloned..Cloned$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h368b936733322da0E", scope: !770, file: !769, line: 44, type: !781, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !776, retainedNodes: !784)
!781 = !DISubroutineType(types: !782)
!782 = !{!660, !783}
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::cloned::Cloned<core::slice::iter::Iter<u16>>", baseType: !314, size: 64, align: 64, dwarfAddressSpace: 0)
!784 = !{!785}
!785 = !DILocalVariable(name: "self", arg: 1, scope: !780, file: !769, line: 44, type: !783)
!786 = !DILocation(line: 44, column: 18, scope: !780)
!787 = !DILocation(line: 45, column: 9, scope: !780)
!788 = !DILocation(line: 46, column: 6, scope: !780)
!789 = distinct !DISubprogram(name: "next<&mut core::slice::iter::ArrayChunks<u8, 2>, [u8; 2]>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h5fa99f22fd232816E", scope: !791, file: !790, line: 45, type: !792, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !808, retainedNodes: !806)
!790 = !DIFile(filename: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/core/src/iter/adapters/copied.rs", directory: "", checksumkind: CSK_MD5, checksum: "8a783814f88d0c75358355976aa6c8a1")
!791 = !DINamespace(name: "{impl#1}", scope: !401)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !805}
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<[u8; 2]>", scope: !37, file: !2, size: 24, align: 8, flags: DIFlagPublic, elements: !795, templateParams: !15, identifier: "b15730a65b81202d23bc87daaa5109bf")
!795 = !{!796}
!796 = !DICompositeType(tag: DW_TAG_variant_part, scope: !794, file: !2, size: 24, align: 8, elements: !797, templateParams: !15, identifier: "48c0c362b54292129898ed8f397d8a41", discriminator: !804)
!797 = !{!798, !800}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !796, file: !2, baseType: !799, size: 24, align: 8, extraData: i128 0)
!799 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !794, file: !2, size: 24, align: 8, flags: DIFlagPublic, elements: !15, templateParams: !418, identifier: "19fb0d7483bb9c24100b8f2773eb46d3")
!800 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !796, file: !2, baseType: !801, size: 24, align: 8, extraData: i128 1)
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !794, file: !2, size: 24, align: 8, flags: DIFlagPublic, elements: !802, templateParams: !418, identifier: "43e1d2bbca3cde01735fe7ab9fe697")
!802 = !{!803}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !801, file: !2, baseType: !415, size: 16, align: 8, offset: 8, flags: DIFlagPublic)
!804 = !DIDerivedType(tag: DW_TAG_member, scope: !794, file: !2, baseType: !45, size: 8, align: 8, flags: DIFlagArtificial)
!805 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>", baseType: !400, size: 64, align: 64, dwarfAddressSpace: 0)
!806 = !{!807}
!807 = !DILocalVariable(name: "self", arg: 1, scope: !789, file: !790, line: 45, type: !805)
!808 = !{!432, !419}
!809 = !DILocation(line: 45, column: 13, scope: !789)
!810 = !DILocation(line: 46, column: 9, scope: !789)
!811 = !DILocation(line: 47, column: 6, scope: !789)
!812 = distinct !DISubprogram(name: "next<core::slice::iter::ArrayChunks<u8, 2>, [u8; 2]>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4next17h75b0106cbd867343E", scope: !791, file: !790, line: 45, type: !813, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !818, retainedNodes: !816)
!813 = !DISubroutineType(types: !814)
!814 = !{!794, !815}
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>", baseType: !618, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !{!817}
!817 = !DILocalVariable(name: "self", arg: 1, scope: !812, file: !790, line: 45, type: !815)
!818 = !{!622, !419}
!819 = !DILocation(line: 45, column: 13, scope: !812)
!820 = !DILocation(line: 46, column: 9, scope: !812)
!821 = !DILocation(line: 47, column: 6, scope: !812)
!822 = distinct !DISubprogram(name: "size_hint<core::slice::iter::ArrayChunks<u8, 2>, [u8; 2]>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h071f82a4bc31955eE", scope: !791, file: !790, line: 58, type: !823, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !818, retainedNodes: !826)
!823 = !DISubroutineType(types: !824)
!824 = !{!660, !825}
!825 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>", baseType: !618, size: 64, align: 64, dwarfAddressSpace: 0)
!826 = !{!827}
!827 = !DILocalVariable(name: "self", arg: 1, scope: !822, file: !790, line: 58, type: !825)
!828 = !DILocation(line: 58, column: 18, scope: !822)
!829 = !DILocation(line: 59, column: 9, scope: !822)
!830 = !DILocation(line: 60, column: 6, scope: !822)
!831 = distinct !DISubprogram(name: "size_hint<&mut core::slice::iter::ArrayChunks<u8, 2>, [u8; 2]>", linkageName: "_ZN104_$LT$core..iter..adapters..copied..Copied$LT$I$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$9size_hint17h446c9bbfa4daeae2E", scope: !791, file: !790, line: 58, type: !832, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !808, retainedNodes: !835)
!832 = !DISubroutineType(types: !833)
!833 = !{!660, !834}
!834 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::iter::adapters::copied::Copied<&mut core::slice::iter::ArrayChunks<u8, 2>>", baseType: !400, size: 64, align: 64, dwarfAddressSpace: 0)
!835 = !{!836}
!836 = !DILocalVariable(name: "self", arg: 1, scope: !831, file: !790, line: 58, type: !834)
!837 = !DILocation(line: 58, column: 18, scope: !831)
!838 = !DILocation(line: 59, column: 9, scope: !831)
!839 = !DILocation(line: 60, column: 6, scope: !831)
!840 = distinct !DISubprogram(name: "fold<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, core::result::Result<core::convert::Infallible, core::char::decode::DecodeUtf16Error>, (), core::iter::traits::iterator::Iterator::for_each::call::{closure_env#0}<char, alloc::string::{impl#13}::extend::{closure_env#0}<core::iter::adapters::GenericShunt<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, core::result::Result<core::convert::Infallible, core::char::decode::DecodeUtf16Error>>>>>", linkageName: "_ZN106_$LT$core..iter..adapters..GenericShunt$LT$I$C$R$GT$$u20$as$u20$core..iter..traits..iterator..Iterator$GT$4fold17h0bc16a9aaaea1196E", scope: !842, file: !841, line: 372, type: !843, scopeLine: 372, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !207, templateParams: !905, retainedNodes: !901)
!841 = !DIFile(filename: "/nix/store/hahzrgjq3ncgd241r37xm63ydm9xxfp7-rust-mixed/lib/rustlib/src/rust/library/core/src/iter/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "2786dbd8628575c12264c51fe9bdf312")
!842 = !DINamespace(name: "{impl#0}", scope: !302)
!843 = !DISubroutineType(types: !844)
!844 = !{null, !845, !7, !895}
!845 = !DICompositeType(tag: DW_TAG_structure_type, name: "GenericShunt<core::char::decode::DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>, core::result::Result<core::convert::Infallible, core::char::decode::DecodeUtf16Error>>", scope: !302, file: !2, size: 384, align: 64, flags: DIFlagProtected, elements: !846, templateParams: !892, identifier: "5b49019a7e5d7f4d75adafd0bd8ecdc7")
!846 = !{!847, !854}
!847 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !845, file: !2, baseType: !848, size: 320, align: 64, offset: 64, flags: DIFlagPrivate)
!848 = !DICompositeType(tag: DW_TAG_structure_type, name: "DecodeUtf16<core::iter::adapters::map::Map<core::iter::adapters::copied::Copied<core::slice::iter::ArrayChunks<u8, 2>>, fn([u8; 2]) -> u16>>", scope: !310, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !849, templateParams: !852, identifier: "94c88d685933aa88f933d5e1e770268b")
!849 = !{!850, !851}
!850 = !DIDerivedType(tag: DW_TAG_member, name: "iter", scope: !848, file: !2, baseType: !637, size: 256, align: 64, flags: DIFlagPrivate)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !848, file: !2, baseType: !339, size: 32, align: 16, offset: 256, flags: DIFlagPrivate)
!852 = !{!853}
!853 = !DITemplateTypeParameter(name: "I", type: !637)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "residual", scope: !845, file: !2, baseType: !855, size: 64, align: 64, flags: DIFlagPrivate)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<core::result::Result<core::convert::Infallible, core::char::decode::DecodeUtf16Error>>", baseType: !856, size: 64, align: 64, dwarfAddressSpace: 0)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<core::convert::Infallible, core::char::decode::DecodeUtf16Error>>", scope: !37, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !857, templateParams: !15, identifier: "b41b5e4674cc7ac9f3943953dbb67c11")
!857 = !{!858}
!858 = !DICompositeType(tag: DW_TAG_variant_part, scope: !856, file: !2, size: 32, align: 16, elements: !859, templateParams: !15, identifier: "2379081f61409e67410626c3fef99780", discriminator: !891)
!859 = !{!860, !887}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !858, file: !2, baseType: !861, size: 32, align: 16, extraData: i128 0)
!861 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !856, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !15, templateParams: !862, identifier: "5d36d4e8ebe4d14fa9441e1aa3b0892c")
!862 = !{!863}
!863 = !DITemplateTypeParameter(name: "T", type: !864)
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, core::char::decode::DecodeUtf16Error>", scope: !865, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !866, templateParams: !15, identifier: "d07c0bf78486eebb9be72b5825b989e5")
!865 = !DINamespace(name: "result", scope: !14)
!866 = !{!867}
!867 = !DICompositeType(tag: DW_TAG_variant_part, scope: !864, file: !2, size: 16, align: 16, elements: !868, templateParams: !15, identifier: "18833a8f3ad60298972bb7fdb06fb098")
!868 = !{!869, !883}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !867, file: !2, baseType: !870, size: 16, align: 16)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !864, file: !2, size: 16, align: 16, flags: DIFlagPublic, elements: !871, templateParams: !877, identifier: "cb4f5de8e655fca7522e878d5c3307d4")
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !870, file: !2, baseType: !873, align: 8, flags: DIFlagPublic)
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !874, file: !2, align: 8, flags: DIFlagPublic, elements: !875, templateParams: !15, identifier: "ef64110331f9aeffb221ad1e888f4cdc")
!874 = !DINamespace(name: "convert", scope: !14)
!875 = !{!876}
!876 = !DICompositeType(tag: DW_TAG_variant_part, scope: !873, file: !2, align: 8, elements: !15, identifier: "344fc7b903cca4792d35c980889810b9")
!877 = !{!878, !879}
